In [2]:
%load_ext sql
%sql mysql+mysqlconnector://root:viswaa@localhost

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [3]:
%%sql 
CREATE database Uber;

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[]

In [4]:
%%sql 
use Uber;

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

In [5]:
%%sql 
show tables;

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

In [7]:
%%sql 
create table uber_ride(
    ride_id INT,
    rider_id INT,
    driver_id INT,
    pickup_location VARCHAR(100),
    drop_location VARCHAR(100),
    date_time DATETIME,
    fare DECIMAL(50,2)
)

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

In [8]:
%%sql
desc uber_ride

 * mysql+mysqlconnector://root:***@localhost
7 rows affected.

[('ride_id', 'int', 'YES', '', None, ''),
 ('rider_id', 'int', 'YES', '', None, ''),
 ('driver_id', 'int', 'YES', '', None, ''),
 ('pickup_location', 'varchar(100)', 'YES', '', None, ''),
 ('drop_location', 'varchar(100)', 'YES', '', None, ''),
 ('date_time', 'datetime', 'YES', '', None, ''),
 ('fare', 'decimal(50,2)', 'YES', '', None, '')]

In [9]:
%%sql
insert into uber_ride (ride_id, rider_id, driver_id, pickup_location, drop_location, date_time, fare) values (001, 001, 100, 'chennai', 'erode', '2025-08-10 13:00:00', 400);

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[]

In [12]:
%%sql 
select * from uber_ride

 * mysql+mysqlconnector://root:***@localhost
11 rows affected.

[(1, 1, 100, 'chennai', 'erode', datetime.datetime(2025, 8, 10, 13, 0), Decimal('400.00')),
 (2, 2, 101, 'Bangalore', 'Mysore', datetime.datetime(2025, 8, 10, 14, 30), Decimal('550.00')),
 (3, 3, 102, 'Coimbatore', 'Salem', datetime.datetime(2025, 8, 10, 15, 15), Decimal('480.00')),
 (4, 4, 103, 'Madurai', 'Chennai', datetime.datetime(2025, 8, 10, 16, 0), Decimal('1200.00')),
 (5, 5, 104, 'Pondicherry', 'Chennai', datetime.datetime(2025, 8, 10, 16, 45), Decimal('750.00')),
 (6, 6, 105, 'Erode', 'Tiruppur', datetime.datetime(2025, 8, 10, 17, 30), Decimal('320.00')),
 (7, 7, 106, 'Trichy', 'Madurai', datetime.datetime(2025, 8, 10, 18, 10), Decimal('680.00')),
 (8, 8, 107, 'Chennai', 'Vellore', datetime.datetime(2025, 8, 10, 18, 45), Decimal('900.00')),
 (9, 9, 108, 'Salem', 'Coimbatore', datetime.datetime(2025, 8, 10, 19, 20), Decimal('500.00')),
 (10, 10, 109, 'Tirunelveli', 'Madurai', datetime.datetime(2025, 8, 10, 20, 5), Decimal('650.00')),
 (11, 11, 110, 'Chennai', 'Bangalore', datetime.datetime(2025, 8, 10, 21, 0), Decimal('1500.00'))]

In [11]:
%%sql
INSERT INTO uber_ride (ride_id, rider_id, driver_id, pickup_location, drop_location, date_time, fare) VALUES
(002, 002, 101, 'Bangalore', 'Mysore', '2025-08-10 14:30:00', 550),
(003, 003, 102, 'Coimbatore', 'Salem', '2025-08-10 15:15:00', 480),
(004, 004, 103, 'Madurai', 'Chennai', '2025-08-10 16:00:00', 1200),
(005, 005, 104, 'Pondicherry', 'Chennai', '2025-08-10 16:45:00', 750),
(006, 006, 105, 'Erode', 'Tiruppur', '2025-08-10 17:30:00', 320),
(007, 007, 106, 'Trichy', 'Madurai', '2025-08-10 18:10:00', 680),
(008, 008, 107, 'Chennai', 'Vellore', '2025-08-10 18:45:00', 900),
(009, 009, 108, 'Salem', 'Coimbatore', '2025-08-10 19:20:00', 500),
(010, 010, 109, 'Tirunelveli', 'Madurai', '2025-08-10 20:05:00', 650),
(011, 011, 110, 'Chennai', 'Bangalore', '2025-08-10 21:00:00', 1500);

 * mysql+mysqlconnector://root:***@localhost
10 rows affected.

[]

In [20]:
%%sql
select * from uber_ride
where fare > 500 and drop_location ='Chennai'
order by fare desc;

 * mysql+mysqlconnector://root:***@localhost
2 rows affected.

[(4, 4, 103, 'Madurai', 'Chennai', datetime.datetime(2025, 8, 10, 16, 0), Decimal('1200.00')),
 (5, 5, 104, 'Pondicherry', 'Chennai', datetime.datetime(2025, 8, 10, 16, 45), Decimal('750.00'))]